import re

#匹配整数或者小数（包括正数和负数）
s = ' 0.32,39.800,89,-7.3,-23'
re.findall(r'-?\d+.?\d*',s)
# ['0.32', '39.800', '89,', '-7.3', '-23']

#匹配年月日日期 格式2018-12-6**
s = '今天是2018-12-14日，天气真好,明天是2019-12-15'
re.findall(r'\d+-\d+-\d+',s)#^[1-9]\d{0,3}-(1[0-2]|0?[1-9])-(3[01]|[12]\d|0?[1-9])$
#['2018-12-14', '2019-12-15']


#匹配qq号
qq = '2294209405,1s2ef56,1667793759,sdkbn57,22875645,4567'
re.findall(r'[1-9]\d{7,11}',qq)

#11位的电话号码
number = '15256431660,18856431819,125,15556118812'
re.findall(r'1\d{10}',number)
#['15256431660', '18856431819', '15556118812']

#长度为8-10位的用户密码 ： 包含数字字母下划线
s = 'wihd83_9ch8,cb8_9du2,_d8c8_k,83_d8h_2df'
re.findall(r'\w{8,10}',s)
#['wihd83_9ch', 'cb8_9du2', '83_d8h_2df']

#匹配验证码：4位数字字母组成的
s = 'mu82,dn3h,J7nn,SO0p,sj_,kdpp0'
re.findall(r'[\da-zA-Z]{4}',s)
#['mu82', 'dn3h', 'J7nn', 'SO0p', 'kdpp']

#匹配邮箱地址

#
s = '<a>wahaha</a>\n<b>banana</b>\n<h1>qqxing</h1'
re.findall(r'\w{6}',s)
#['wahaha', 'banana', 'qqxing']

re.findall(r'</?\w[1-6]?>',s)
#['<a>', '</a>', '<b>', '</b>', '<h1>']

s = '1-2*((60-30+(-40/5)*(9-2*5/3+7/3*99/4*2998+10*568/14))-(-4*3)/(16-3*2))'
re.findall(r'([^()]+)',s)
"""
1-2*',
 '60-30+',
 '-40/5',
 '*',
 '9-2*5/3+7/3*99/4*2998+10*568/14',
 '-',
 '-4*3',
 '/',
 '16-3*2']
 """
#匹配出从左到右第一个乘法或除法
s = '9-2*5/3+7/3*99/4*2998+10*568/14'
re.search(r'\d+[*/]\d+',s).group()
#'2*5'


